Revit 2024 API
ParameterTypeId.FabricationPartDiameterOutOption Property
 "Main Secondary Diameter Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationPartDiameterOutOption { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartDiameterOutOption As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationPartDiameterOutOption {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace